#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`
#### Checkov 🧪`success`

<details><summary>Show Plan</summary>

```

module.datalake["storage1"].data.azurerm_subnet.subnet_private_endpoint["pe2"]: Reading...
module.datalake["storage1"].data.azurerm_subnet.subnet_private_endpoint["pe1"]: Reading...
module.databricks["dbw1"].data.azurerm_virtual_network.databricks: Reading...
module.databricks["dbw1"].data.azurerm_subnet.subnet_private_endpoint["databricks_pe1"]: Reading...
module.datalake["storage1"].azurerm_storage_account.stgaccount: Refreshing state... [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Storage/storageAccounts/elexdeveun01]
module.databricks["dbw1"].data.azurerm_subnet.subnet_private_endpoint["databricks_pe1"]: Read complete after 1s [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/virtualNetworks/elex-demo-eu2-vnet-0001/subnets/adb-pep-subnet]
module.datalake["storage1"].data.azurerm_subnet.subnet_private_endpoint["pe2"]: Read complete after 1s [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/virtualNetworks/elex-demo-eu2-vnet-0001/subnets/stg-pep-snet1]
module.datalake["storage1"].data.azurerm_subnet.subnet_private_endpoint["pe1"]: Read complete after 1s [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/virtualNetworks/elex-demo-eu2-vnet-0001/subnets/stg-pep-snet1]
module.databricks["dbw1"].data.azurerm_virtual_network.databricks: Read complete after 1s [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/virtualNetworks/elex-demo-eu2-vnet-0001]
module.datalake["storage1"].azurerm_private_endpoint.private_endpoint_storage_account["pe2"]: Refreshing state... [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/privateEndpoints/priep-st-elex-dev01-eun-02]
module.datalake["storage1"].azurerm_private_endpoint.private_endpoint_storage_account["pe1"]: Refreshing state... [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/privateEndpoints/priep-st-elex-dev01-eun-01]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.databricks["dbw1"].azurerm_databricks_workspace.databricks will be created
  + resource "azurerm_databricks_workspace" "databricks" {
      + customer_managed_key_enabled          = false
      + disk_encryption_set_id                = (known after apply)
      + id                                    = (known after apply)
      + infrastructure_encryption_enabled     = false
      + location                              = "eastus"
      + managed_disk_identity                 = (known after apply)
      + managed_resource_group_id             = (known after apply)
      + managed_resource_group_name           = "elex-demo-eu2-rg-0005"
      + name                                  = "elex-demo-eu-dbw-0001"
      + network_security_group_rules_required = (known after apply)
      + public_network_access_enabled         = true
      + resource_group_name                   = "elex-demo-eu2-rg-0001"
      + sku                                   = "premium"
      + storage_account_identity              = (known after apply)
      + tags                                  = {
          + "CostCenter"  = "CostCenter code"
          + "application" = "demo app name"
          + "department"  = "Example dept"
          + "environment" = "demo"
          + "owner"       = "Example Project owner"
        }
      + workspace_id                          = (known after apply)
      + workspace_url                         = (known after apply)

      + custom_parameters {
          + machine_learning_workspace_id                        = "/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.MachineLearningServices/workspaces/azml-elx-dev-eun-01"
          + nat_gateway_name                                     = (known after apply)
          + no_public_ip                                         = true
          + private_subnet_name                                  = "elex-demo-eu2-snet-0002"
          + private_subnet_network_security_group_association_id = "/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/networkSecurityGroups/elex-demo-nsg"
          + public_ip_name                                       = (known after apply)
          + public_subnet_name                                   = "elex-demo-eu2-snet-0001"
          + public_subnet_network_security_group_association_id  = "/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/networkSecurityGroups/elex-demo-nsg"
          + storage_account_name                                 = "elexdemoeu2sa0012"
          + storage_account_sku_name                             = "Standard_LRS"
          + virtual_network_id                                   = "/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/virtualNetworks/elex-demo-eu2-vnet-0001"
          + vnet_address_prefix                                  = (known after apply)
        }
    }

  # module.databricks["dbw1"].azurerm_private_endpoint.pep["databricks_pe1"] will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "databricks"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "elex-demo-eu2-rg-0001"
      + subnet_id                = "/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/virtualNetworks/elex-demo-eu2-vnet-0001/subnets/adb-pep-subnet"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "adbzonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/privateDnsZones/privatelink.databricks.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "databricks-service-connection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "databricks_ui_api",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

<details><summary>Show Checkov Results</summary>


       _               _              
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V / 
  \___|_| |_|\___|\___|_|\_\___/ \_/  
                                      
By bridgecrew.io | version: 2.4.41 
terraform scan results:

Passed checks: 3, Failed checks: 7, Skipped checks: 0

Check: CKV_AZURE_36: "Ensure 'Trusted Microsoft Services' is enabled for Storage Account access"
	PASSED for resource: module.datalake["storage1"].azurerm_storage_account.stgaccount
	File: /terraform/modules/data/storage_account/storage_account.tf:1-80
	Calling File: /terraform/env/dev/data/main.tf:9-14
	Guide: https://docs.paloaltonetworks.com/content/techdocs/en_US/prisma/prisma-cloud/prisma-cloud-code-security-policy-reference/azure-policies/azure-networking-policies/enable-trusted-microsoft-services-for-storage-account-access.html
Check: CKV_AZURE_33: "Ensure Storage logging is enabled for Queue service for read, write and delete requests"
	PASSED for resource: module.datalake["storage1"].azurerm_storage_account.stgaccount
	File: /terraform/modules/data/storage_account/storage_account.tf:1-80
	Calling File: /terraform/env/dev/data/main.tf:9-14
	Guide: https://docs.paloaltonetworks.com/content/techdocs/en_US/prisma/prisma-cloud/prisma-cloud-code-security-policy-reference/azure-policies/azure-logging-policies/enable-requests-on-storage-logging-for-queue-service.html
Check: CKV2_AZURE_33: "Ensure storage account is configured with private endpoint"
	PASSED for resource: module.datalake["storage1"].azurerm_storage_account.stgaccount
	File: /terraform/modules/data/storage_account/storage_account.tf:1-80
Check: CKV_AZURE_44: "Ensure Storage Account is using the latest version of TLS encryption"
	FAILED for resource: module.datalake["storage1"].azurerm_storage_account.stgaccount
	File: /terraform/modules/data/storage_account/storage_account.tf:1-80
	Calling File: /terraform/env/dev/data/main.tf:9-14
	Guide: https://docs.paloaltonetworks.com/content/techdocs/en_US/prisma/prisma-cloud/prisma-cloud-code-security-policy-reference/azure-policies/azure-storage-policies/bc-azr-storage-2.html

		Code lines for this resource are too many. Please use IDE of your choice to review the file.
Check: CKV_AZURE_35: "Ensure default network access rule for Storage Accounts is set to deny"
	FAILED for resource: module.datalake["storage1"].azurerm_storage_account.stgaccount
	File: /terraform/modules/data/storage_account/storage_account.tf:1-80
	Calling File: /terraform/env/dev/data/main.tf:9-14
	Guide: https://docs.paloaltonetworks.com/content/techdocs/en_US/prisma/prisma-cloud/prisma-cloud-code-security-policy-reference/azure-policies/azure-networking-policies/set-default-network-access-rule-for-storage-accounts-to-deny.html

		Code lines for this resource are too many. Please use IDE of your choice to review the file.
Check: CKV_AZURE_144: "Ensure that Public Access is disabled for Machine Learning Workspace"
	FAILED for resource: module.machine_learning["mlw1"].azurerm_machine_learning_workspace.machine_learning_workspace
	File: /terraform/modules/machine-learning/ml.tf:1-22
	Calling File: /terraform/env/dev/machine-learning/main.tf:1-11
	Guide: https://docs.paloaltonetworks.com/content/techdocs/en_US/prisma/prisma-cloud/prisma-cloud-code-security-policy-reference/azure-policies/azure-networking-policies/ensure-azure-machine-learning-workspace-is-not-publicly-accessible.html

		1  | resource "azurerm_machine_learning_workspace" "machine_learning_workspace" {
		2  |   name                    = "azml-elx-${var.machine_learning_workspace.env}-eun-${var.machine_learning_workspace.instance_number}"
		3  |   location                = var.machine_learning_workspace.location
		4  |   resource_group_name     = var.machine_learning_workspace.resource_group_name
		5  |   application_insights_id = data.azurerm_application_insights.application_insights.id
		6  |   key_vault_id            = data.azurerm_key_vault.key_vault.id
		7  |   storage_account_id      = data.azurerm_storage_account.storage_account.id
		8  |   # container_registry_id   = data.azurerm_container_registry.container_registry.id
		9  |   sku_name                = try(var.machine_learning_workspace.sku_name, null)
		10 |   description             = try(var.machine_learning_workspace.description, null)
		11 |   friendly_name           = try(var.machine_learning_workspace.friendly_name, null)
		12 |   high_business_impact    = try(var.machine_learning_workspace.high_business_impact, null)
		13 |   tags                    = try(var.machine_learning_workspace.tags, null)
		14 | 
		15 |   dynamic "identity" {
		16 |     for_each = try(var.machine_learning_workspace.identity, null) != null ? [var.machine_learning_workspace.identity] : []
		17 |     content {
		18 |       type = try(var.machine_learning_workspace.identity.type, "SystemAssigned")
		19 |     }
		20 |   }
		21 | 
		22 | }

Check: CKV_AZURE_142: "Ensure Machine Learning Compute Cluster Local Authentication is disabled"
	FAILED for resource: module.machine_learning["mlw1"].azurerm_machine_learning_compute_cluster.machine_learning_compute_cluster
	File: /terraform/modules/machine-learning/ml_compute_cluster.tf:1-36
	Calling File: /terraform/env/dev/machine-learning/main.tf:1-11
	Guide: https://docs.paloaltonetworks.com/content/techdocs/en_US/prisma/prisma-cloud/prisma-cloud-code-security-policy-reference/azure-policies/azure-iam-policies/ensure-azure-machine-learning-compute-cluster-local-authentication-is-disabled.html

		1  | resource "azurerm_machine_learning_compute_cluster" "machine_learning_compute_cluster" {
		2  |   for_each                      = var.machine_learning_compute_cluster
		3  |   name                          = "mlcc-elx-${each.value.env}-eun-${each.value.instance_number}"
		4  |   location                      = each.value.location
		5  |   vm_priority                   = each.value.vm_priority
		6  |   vm_size                       = each.value.vm_size
		7  |   machine_learning_workspace_id = azurerm_machine_learning_workspace.machine_learning_workspace.id
		8  |   subnet_resource_id            = data.azurerm_subnet.subnet_mlcc[each.key].id
		9  |   tags                          = try(each.value.tags, null)
		10 | 
		11 | 
		12 |   dynamic "scale_settings" {
		13 |     for_each = try(each.value.scale_settings, null) != null ? [each.value.scale_settings] : []
		14 |     content {
		15 |       min_node_count                       = try(each.value.min_node_count, 0)
		16 |       max_node_count                       = try(each.value.max_node_count, 1)
		17 |       scale_down_nodes_after_idle_duration = try(each.value.scale_down_nodes_after_idle_duration, "PT30S")
		18 |     }
		19 |   }
		20 | 
		21 |   dynamic "identity" {
		22 |     for_each = try(each.value.identity, null) != null ? [each.value.identity] : []
		23 |     content {
		24 |       type = try(each.value.type, "SystemAssigned")
		25 |     }
		26 |   }
		27 |   
		28 |   lifecycle {
		29 |     ignore_changes        = [
		30 |       machine_learning_workspace_id,
		31 |       subnet_resource_id,
		32 |       tags
		33 |     ]
		34 |   }
		35 | 
		36 | }

Check: CKV_AZURE_150: "Ensure Machine Learning Compute Cluster Minimum Nodes Set To 0"
	FAILED for resource: module.machine_learning["mlw1"].azurerm_machine_learning_compute_cluster.machine_learning_compute_cluster
	File: /terraform/modules/machine-learning/ml_compute_cluster.tf:1-36
	Calling File: /terraform/env/dev/machine-learning/main.tf:1-11
	Guide: https://docs.paloaltonetworks.com/content/techdocs/en_US/prisma/prisma-cloud/prisma-cloud-code-security-policy-reference/azure-policies/azure-general-policies/ensure-azure-machine-learning-compute-cluster-minimum-nodes-is-set-to-0.html

		1  | resource "azurerm_machine_learning_compute_cluster" "machine_learning_compute_cluster" {
		2  |   for_each                      = var.machine_learning_compute_cluster
		3  |   name                          = "mlcc-elx-${each.value.env}-eun-${each.value.instance_number}"
		4  |   location                      = each.value.location
		5  |   vm_priority                   = each.value.vm_priority
		6  |   vm_size                       = each.value.vm_size
		7  |   machine_learning_workspace_id = azurerm_machine_learning_workspace.machine_learning_workspace.id
		8  |   subnet_resource_id            = data.azurerm_subnet.subnet_mlcc[each.key].id
		9  |   tags                          = try(each.value.tags, null)
		10 | 
		11 | 
		12 |   dynamic "scale_settings" {
		13 |     for_each = try(each.value.scale_settings, null) != null ? [each.value.scale_settings] : []
		14 |     content {
		15 |       min_node_count                       = try(each.value.min_node_count, 0)
		16 |       max_node_count                       = try(each.value.max_node_count, 1)
		17 |       scale_down_nodes_after_idle_duration = try(each.value.scale_down_nodes_after_idle_duration, "PT30S")
		18 |     }
		19 |   }
		20 | 
		21 |   dynamic "identity" {
		22 |     for_each = try(each.value.identity, null) != null ? [each.value.identity] : []
		23 |     content {
		24 |       type = try(each.value.type, "SystemAssigned")
		25 |     }
		26 |   }
		27 |   
		28 |   lifecycle {
		29 |     ignore_changes        = [
		30 |       machine_learning_workspace_id,
		31 |       subnet_resource_id,
		32 |       tags
		33 |     ]
		34 |   }
		35 | 
		36 | }

Check: CKV2_AZURE_38: "Ensure soft-delete is enabled on Azure storage account"
	FAILED for resource: module.datalake["storage1"].azurerm_storage_account.stgaccount
	File: /terraform/modules/data/storage_account/storage_account.tf:1-80

		Code lines for this resource are too many. Please use IDE of your choice to review the file.
Check: CKV2_AZURE_1: "Ensure storage for critical data are encrypted with Customer Managed Key"
	FAILED for resource: module.datalake["storage1"].azurerm_storage_account.stgaccount
	File: /terraform/modules/data/storage_account/storage_account.tf:1-80
	Guide: https://docs.paloaltonetworks.com/content/techdocs/en_US/prisma/prisma-cloud/prisma-cloud-code-security-policy-reference/azure-policies/azure-general-policies/ensure-storage-for-critical-data-are-encrypted-with-customer-managed-key.html

		Code lines for this resource are too many. Please use IDE of your choice to review the file.


Wrote output in SARIF format to the file 'results.sarif'

</details>

*Pushed by: @amro-acc, Action: `pull_request`, Workflow: `Dev-Apply-Data`*